In [1]:
from IPython.display import Image
import numpy as np
import pandas as pd
import seaborn as sns

In [5]:
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
# slicing은 [시작(포함): 끝(포함)] 
# 5행의 class 값 가져와 보기 


df.loc[5,"class"]

'Third'

In [7]:
df.loc[1:4,["age","embarked","class"]] # 인덱스가 1~4까지 컬럼은 age, embarked, class

    age embarked  class
1  38.0        C  First
2  26.0        S  Third
3  35.0        S  First
4  35.0        S  Third

In [8]:
df.loc[:5,"class":"deck"]  # 인덱스 5번까지 class ~ deck 컬럼까지

   class    who  adult_male deck
0  Third    man        True  NaN
1  First  woman       False    C
2  Third  woman       False  NaN
3  First  woman       False    C
4  Third    man        True  NaN
5  Third    man        True  NaN

In [9]:
df["who"] == "man"

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: who, Length: 891, dtype: bool

In [10]:
# age 열만 가져오자
df["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [13]:
df.loc[:,"age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [16]:
# loc 조건 

c1 = df["fare"] > 30
c2 = df["who"] == "woman"
df.loc[c1 & c2]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,100,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,100,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
25,1,3,female,100,1,5,31.3875,S,Third,woman,False,NaN,Southampton,yes,False
31,1,1,female,100,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,100,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
853,1,1,female,100,0,1,39.4000,S,First,woman,False,D,Southampton,yes,False
856,1,1,female,100,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
863,0,3,female,100,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
871,1,1,female,100,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,100,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False

In [17]:
df.loc[c1|c2]  # | 는 shift + \

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,100,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,100,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,100,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,100,0,0,51.8625,S,First,man,True,E,Southampton,no,True
8,1,3,female,100,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,100,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,100,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,100,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,100,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,100,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [18]:
## 연습문제 

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# 나이가 30살 이상 남자 승객 조건 필터링
# fare를 많이 낸 순서로 내림차순 정렬
# 상위 10개를 출력

In [25]:
c1 = df["age"] >= 30 
c2 = df["sex"] == "male"
answer1 = df.loc[c1 & c2].sort_values(by="fare", ascending = False)
answer1.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
332,0,1,male,38.0,0,1,153.4625,S,First,man,True,C,Southampton,no,False
660,1,1,male,50.0,2,0,133.6500,S,First,man,True,NaN,Southampton,yes,False
390,1,1,male,36.0,1,2,120.0000,S,First,man,True,B,Southampton,yes,False
659,0,1,male,58.0,0,2,113.2750,C,First,man,True,D,Cherbourg,no,False
698,0,1,male,49.0,1,1,110.8833,C,First,man,True,C,Cherbourg,no,False
544,0,1,male,50.0,1,0,106.4250,C,First,man,True,C,Cherbourg,no,False
224,1,1,male,38.0,1,0,90.0000,S,First,man,True,C,Southampton,yes,False

In [ ]:
# 나이가 20살 이상 40살 미만인 승객
# pclass가 1등급 혹은 2등급인 승객
# 열(column)은 survived, pclass, age, fare 만 나오게 출력
# 10개만 출력

In [26]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [33]:
c1 = (df["age"] >=20) & (df["age"] < 40)
c2 = (df["pclass"] == 1)|(df["pclass"] == 2)
answer2 = df.loc[c1 & c2,["survived", "pclass", "age", "fare"]]
answer2.head(10)

# df[행 인덱스 값, 열 인덱싱 값]

    survived  pclass   age     fare
1          1       1  38.0  71.2833
3          1       1  35.0  53.1000
20         0       2  35.0  26.0000
21         1       2  34.0  13.0000
23         1       1  28.0  35.5000
34         0       1  28.0  82.1708
41         0       2  27.0  21.0000
53         1       2  29.0  26.0000
56         1       2  21.0  10.5000
61         1       1  38.0  80.0000

In [47]:
# pclass가 1, 2등급인 승객 중 나이 값이 없는(NaN) 데이터는
# 나이의 평균 값으로 채워라 

c1 = (df["pclass"] ==1)|(df["pclass"] ==2)

answer3 = df.loc[c1]
answer3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [48]:
answer3["age"].isnull().sum() # 총 41개 null값이다. age 컬럼 중에서

41

In [56]:
mean_age = answer3["age"].mean()
mean_age

34.206824512534816

In [58]:
answer3["age"] = answer3["age"].replace(to_replace = np.nan, value= mean_age)
answer3["age"]

<ipython-input-58-796f6a5ac2c0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  answer3["age"] = answer3["age"].replace(to_replace = np.nan, value= mean_age)

1      38.0
3      35.0
6      54.0
9      14.0
11     58.0
       ...
880    25.0
883    28.0
886    27.0
887    19.0
889    26.0
Name: age, Length: 400, dtype: float64

In [59]:
answer3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [60]:
print(df['age'].isnull().sum())
print(df['age'].mean())

177
29.69911764705882

In [61]:
# 2. iloc 
# iloc는 인덱싱만 사용한다. 
df.iloc[1,3] #  1인덱스, 3열.

38.0

In [62]:
df.iloc[[0,3,4],[0,1,2,3]]

   survived  pclass     sex   age
0         0       3    male  22.0
3         1       1  female  35.0
4         0       3    male  35.0

In [63]:
df.iloc[:3,:5]

   survived  pclass     sex   age  sibsp
0         0       3    male  22.0      1
1         1       1  female  38.0      1
2         1       3  female  26.0      0

In [65]:
# at >> 하나의 인덱스만 가져오기 
# 숫자뿐만 아니라, 컬럼 이름명으로도 가능

df.at[0,"fare"]

7.25

In [67]:
# iat >> 하나의 인덱스만 가져오기

df.iat[0,5]

0